{
  "2005.10488v1": {
    "title": "Does an artificial intelligence perform market manipulation with its own discretion? -- A genetic algorithm learns in an artificial market simulation",
    "authors": [
      "Takanobu Mizuta"
    ],
    "summary": "Who should be charged with responsibility for an artificial intelligence\nperforming market manipulation have been discussed. In this study, I\nconstructed an artificial intelligence using a genetic algorithm that learns in\nan artificial market simulation, and investigated whether the artificial\nintelligence discovers market manipulation through learning with an artificial\nmarket simulation despite a builder of artificial intelligence has no intention\nof market manipulation. As a result, the artificial intelligence discovered\nmarket manipulation as an optimal investment strategy. This result suggests\nnecessity of regulation, such as obligating builders of artificial intelligence\nto prevent artificial intelligence from performing market manipulation.",
    "pdf_url": "http://arxiv.org/pdf/2005.10488v1",
    "published": "2020-05-21"
  },
  "2304.02924v1": {
    "title": "The Governance of Physical Artificial Intelligence",
    "authors": [
      "Yingbo Li",
      "Anamaria-Beatrice Spulber",
      "Yucong Duan"
    ],
    "summary": "Physical artificial intelligence can prove to be one of the most important\nchallenges of the artificial intelligence. The governance of physical\nartificial intelligence would define its responsible intelligent application in\nthe society.",
    "pdf_url": "http://arxiv.org/pdf/2304.02924v1",
    "published": "2023-04-06"
  },
  "2102.12076v1": {
    "title": "Perspective: Purposeful Failure in Artificial Life and Artificial Intelligence",
    "authors": [
      "Lana Sinapayen"
    ],
    "summary": "Complex systems fail. I argue that failures can be a blueprint characterizing\nliving organisms and biological intelligence, a control mechanism to increase\ncomplexity in evolutionary simulations, and an alternative to classical fitness\noptimization. Imitating biological successes in Artificial Life and Artificial\nIntelligence can be misleading; imitating failures offers a path towards\nunderstanding and emulating life it in artificial systems.",
    "pdf_url": "http://arxiv.org/pdf/2102.12076v1",
    "published": "2021-02-24"
  },
  "1105.1534v1": {
    "title": "Taking the redpill: Artificial Evolution in native x86 systems",
    "authors": [
      "Thomas Sperl"
    ],
    "summary": "In analogon to successful artificial evolution simulations as Tierra or\navida, this text presents a way to perform artificial evolution in a native x86\nsystem. The implementation of the artificial chemistry and first results of\nstatistical experiments are presented.",
    "pdf_url": "http://arxiv.org/pdf/1105.1534v1",
    "published": "2011-05-08"
  },
  "1509.01213v1": {
    "title": "Impact of Artificial Intelligence on Economic Theory",
    "authors": [
      "Tshilidzi Marwala"
    ],
    "summary": "Artificial intelligence has impacted many aspects of human life. This paper\nstudies the impact of artificial intelligence on economic theory. In particular\nwe study the impact of artificial intelligence on the theory of bounded\nrationality, efficient market hypothesis and prospect theory.",
    "pdf_url": "http://arxiv.org/pdf/1509.01213v1",
    "published": "2015-07-01"
  }
}